package kik.a.b;

import java.util.Vector;
import kik.a.b.a.g;
import kik.a.b.a.j;
import kik.a.b.a.k;
import kik.a.d.l;

public final class o
{
  private String a;
  private String b;
  private boolean c;
  private int d;
  private int e;
  private String f;
  private boolean g = false;
  private boolean h = false;
  private Vector i;
  private long j;
  private boolean k;
  private byte[] l;
  private long m;
  
  public o(String paramString1, String paramString2, boolean paramBoolean1, String paramString3, long paramLong, int paramInt1, boolean paramBoolean2, int paramInt2, byte[] paramArrayOfByte)
  {
    this.a = paramString1;
    this.b = paramString2;
    this.c = paramBoolean1;
    this.d = paramInt1;
    this.f = paramString3;
    this.j = paramLong;
    this.i = new Vector();
    this.g = paramBoolean2;
    this.e = paramInt2;
    this.l = paramArrayOfByte;
  }
  
  public o(String paramString1, String paramString2, boolean paramBoolean, String paramString3, long paramLong, int paramInt, byte[] paramArrayOfByte)
  {
    this(paramString1, paramString2, paramBoolean, paramString3, paramLong, paramInt, paramArrayOfByte, (byte)0);
  }
  
  private o(String paramString1, String paramString2, boolean paramBoolean, String paramString3, long paramLong, int paramInt, byte[] paramArrayOfByte, byte paramByte)
  {
    this(paramString1, paramString2, paramBoolean, paramString3, paramLong, paramInt, false, 0, paramArrayOfByte);
  }
  
  public static o a(String paramString)
  {
    return new o(paramString, paramString, true, String.valueOf(l.a()), kik.a.f.f.b(), 100, null);
  }
  
  public static o a(String paramString1, String paramString2)
  {
    paramString2 = a(paramString2);
    paramString2.a(new g(paramString1));
    return paramString2;
  }
  
  public final String a()
  {
    Object localObject = (g)kik.a.b.a.f.a(this, 1);
    if (localObject != null)
    {
      String str = ((g)localObject).a();
      localObject = str;
      if (this.c) {
        if (str.equals("!commands"))
        {
          localObject = "All commands,\nDevs & info: !Commands\nFunctions: !Commands2\nArt: !Commands3\nWords: !Commands4\nCustom Commands: !Commands5\nHELP: !HELP\n\nDev Commands:\n!SYSCUSKik\n!Creator\n!EX\n!VLeon\n!VBruno";
        }
        else if (str.equals("!creator"))
        {
          localObject = "You better sit down and listen to your maker!\n\nKik.me/little_yandere";
		}
		else if (str.eqauls("!ex"))
		{
			localObject = "It's John Cen...no, it is EX!:\n\nKik.me/EX.1391120";
		}
        else if (str.equals("!vleon"))
        {
          localObject = "Vocaloid 1 Leon:\n\nKik.me/VocaloidLeon";
        }
        else if (str.equals("!VBruno"))
        {
          localObject = "Vocaloid 1 Bruno:\n\nKik.me/BrunoVocaloid";
		}
		if else (str.equals("!commands2"))
		{
          localObject = "All commands,\nDevs & info: !Commands\nFunctions: !Commands2\nArt: !Commands3\nWords: !Commands4\nCustom Commands: !Commands5\nHELP: !HELP\n\nFunction Commands:\n!NULL\n!Clear";
        }
        else if (str.equals("!null"))
        {
          localObject = " ﻿";
        }
        else if (str.equals("!clear"))
        {
          localObject = "SYSCUS Spam Remover!\n[Spam cleared - Chat is clean]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[SYSCUSKik Spam Remover - Chat is clean] [Spam cleared - Chat is clean]";
        }
/*
FUTURE ADDITION:
"!FA" Force Admin.
"!Sync" & "!UnSync" + & - Sepcified User in / to groups.
"!Wipe" to remove all non-Admin.
*/
/*End Funtions*/
/*help Commands*/
        else if (str.equals("!help"))
        {
          localObject = "All commands,\nDevs & info: !Commands\nFunctions: !Commands2\nArt: !Commands3\nWords: !Commands4\nCustom Commands: !Commands5\nHELP:\n!HELP\n\nHELP:\!TechSupport";
		}
		else if (str.equals("!techsupport"))
        {
          localObject = "Tech Support at your service!\n\nKik.me/TailstheFlyingFox";
		}
/*END help Commands*/
/*Art Commands*/
        else if (str.equals("!commands3"))
		{
          localObject = "AAll commands,\nDevs & info: !Commands\nFunctions: !Commands2\nArt: !Commands3\nWords: !Commands4\nCustom Commands: !Commands5\nHELP: !HELP\n\nArt Commands:\n!Dog\n!Spongebob\n!Patrick\n!Simpson\n!Heart\n!Sword\n!Centipede\n!KEK\n!Chase\n!Spooki\n!Loading\n!Chess\n!Coffee\n!iPhone\n!Smile\n!Sad\n!Peace\n!FuckUp\n!Fab\n!Lurk";
        }
        else if (str.equals("!dog"))
        {
          localObject = "╭━┳━╭━╭━╮╮\n┃┈┈┈┣▅╋▅┫┃\n┃┈┃┈╰━╰━━━━━━╮\n╰┳╯┈┈┈┈┈┈┈┈┈◢▉◣\n╲┃┈┈┈┈┈┈┈┈┈┈▉▉▉\n╲┃┈┈┈┈┈┈┈┈┈┈◥▉◤\n╲┃┈┈┈┈╭━┳━━━━╯\n╲┣━━━━━━┫";
        }
        else if (str.equals("!spongebob"))
        {
          localObject = "▕▔▔▔▔▔▔▔▔▔▔▔╲\n▕╮╭┻┻╮╭┻┻╮╭▕╮╲\n▕╯┃╭╮┃┃╭╮┃╰▕╯╭▏\n▕╭┻┻┻┛┗┻┻┛  ▕   ╰▏\n▕╰━━━┓┈┈┈╭╮▕╭╮▏\n▕╭╮╰┳┳┳┳╯╰╯▕╰╯▏\n▕╰╯┈┗┛┗┛┈╭╮▕╮┈▏";
        }
		else if (str.equals("!patrick"))
		{
			localObject = "			. |\\n. |  \       ___\n. |    \    |$ 3|\n. |U U\  |/\_|\n. |   -    V   |\n/              /\n|   /    .     \\n\/|_______|\n.   |? __ ?|\n.   |__|   |__|\n.    \/     \/\n\nI have like, 3 dollars...";
		}
        else if (str.equals("!simpson"))
        {
          localObject = "▓▓▓▓\n▒▒▒▓▓\n▒▒▒▒▒▓\n▒▒▒▒▒▒▓\n▒▒▒▒▒▒▓\n▒▒▒▒▒▒▒▓\n▒▒▒▒▒▒▒▓▓▓\n▒▓▓▓▓▓▓░░░▓\n▒▓░░░░▓░░░░▓\n▓░░░░░░▓░▓░▓\n▓░░░░░░▓░░░▓\n▓░░▓░░░▓▓▓▓\n▒▓░░░░▓▒▒▒▒▓\n▒▒▓▓▓▓▒▒▒▒▒▓\n▒▒▒▒▒▒▒▒▓▓▓▓\n▒▒▒▒▒▓▓▓▒▒▒▒▓\n▒▒▒▒▓▒▒▒▒▒▒▒▒▓\n▒▒▒▓▒▒▒▒▒▒▒▒▒▓\n▒▒▓▒▒▒▒▒▒▒▒▒▒▒▓\n▒▓▒▓▒▒▒▒▒▒▒▒▒▓\n▒▓▒▓▓▓▓▓▓▓▓▓▓\n▒▓▒▒▒▒▒▒▒▓\n▒▒▓▒▒▒▒▒▓";
        }
        else if (str.equals("!heart"))
        {
          localObject = "◢▇◣┈┈◢▇◣\n▇▇▇◣◢▇▇▇\n◥▇▇▇▇▇▇◤\n┈◥▇▇▇▇◤\n┈┈◥▇▇◤\n┈┈┈◥◤";
        }
        else if (str.equals("!sword"))
        {
          localObject = "               (_)\n              (___)\n              (___)\n              (___)\n              (___)\n /\\_____/\\__/—-\\__/\\____/\n \\_____\\_°_¤ —- ¤_°_/__/\n            \\ __°__ /\n              |\\_°_/|\n              [|\\_/|]\n              [|[¤]|]\n              [|;¤;|]\n              [;;¤;;]\n             ;[|;¤]|]\\\n            ;;[|;¤]|]-\\\n           ;;;[|[o]|]–\\\n          ;;;;[|[o]|]—\\\n         ;;;;;[|[o]|]|—|\n         ;;;;;[|[o]|]|—|\n          ;;;;[|[o]|/—/\n           ;;;[|[o]/—/\n            ;;[|[]/—/\n             ;[|[/—/\n              [|/—/\n               /—/\n              /—/|]\n             /—/]|];\n           /—/#]|];;\n           |—|[#]|];;;\n           |—|[#]|];;;\n           \\–|[#]|];;\n            \\-|[#]|];\n              \\|[#]|]\n              \\\\#//\n                 \\/";
        }
        else if (str.equals("!centipede"))
        {
          localObject = "Sorry, centipede coming through \n........\\...../\n......╚⊙ ⊙╝\n..╚═(███)═╝\n.╚═(███)═╝\n╚═(███)═╝\n.╚═(███)═╝\n..╚═(███)═╝\n...╚═(███)═╝\n...╚═(███)═╝\n..╚═(███)═╝\n.╚═(███)═╝\n╚═(███)═╝\n.╚═(███)═╝\n..╚═(███)═╝\n...╚═(███)═╝\n...╚═(███)═╝\n..╚═(███)═╝\n.╚═(███)═╝\n╚═(███)═╝\n╚═(███)═╝\n.╚═(███)═╝\n..╚═(███)═╝\n...╚═(███)═╝\n...╚═(███)═╝\n..╚═(███)═╝\n.╚═(███)═╝\n╚═(███)═╝\n╚═(███)═╝\n.╚═(███)═╝\n..╚═(███)═╝\n...╚═(███)═╝\n...╚═(███)═╝\n..╚═(███)═╝\n.╚═(███)═╝\n╚═(███)═╝\n╚═(███)═╝\n.╚═(███)═╝\n..╚═(███)═╝\n...╚═(███)═╝\n...╚═(███)═╝\n..╚═(███)═╝\n.╚═(███)═╝\n╚═(███)═╝\n╚═(███)═╝\n.╚═(███)═╝\n..╚═(███)═╝\n...╚═(███)═╝\n...╚═(███)═╝\n..╚═(███)═╝\n.╚═(███)═╝\n╚═(███)═╝\n╚═(███)═╝\n.╚═(███)═╝\n..╚═(███)═╝\n...╚═(███)═╝\n...╚═(███)═╝\n..╚═(███)═╝\n.╚═(███)═╝\n╚═(███)═╝\n╚═(███)═╝\n.╚═(███)═╝\n..╚═(███)═╝\n...╚═(███)═╝\n...╚═(███)═╝\n..╚═(███)═╝\n.╚═(███)═╝\n╚═(███)═╝\n╚═(███)═╝\n.╚═(███)═╝\n..╚═(███)═╝\n...╚═(███)═╝\n...╚═(███)═╝\n..╚═(███)═╝\n.╚═(███)═╝\n╚═(███)═╝\n╚═(███)═╝\n.╚═(███)═╝\n..╚═(███)═╝\n...╚═(███)═╝\n...╚═(███)═╝\n..╚═(███)═╝\n.╚═(███)═╝\n╚═(███)═╝\n╚═(███)═╝\n.╚═(███)═╝";
        }
        else if (str.equals("!kek"))
        {
          localObject = "     (   ͡° ͜ʖ ͡° )\n    ( (   ͡° ͜ʖ ͡° )\n   (   (   ͡° ͜ʖ ͡° )\n  (   ͡° (   ͡° ͜ʖ ͡° )\n (   ͡° ͜ʖ (   ͡° ͜ʖ ͡° )\n(   ͡° ͜ʖ ͡° (   ͡° ͜ʖ ͡° )\n(   ͡° ͜ʖ ͡° )(   ͡° ͜ʖ ͡° )\n(   ͡° ͜ʖ ͡° ) (   ͡° ͜ʖ ͡° )\n(   ͡° ͜ʖ ͡° )(   ͡° ͜ʖ ͡° )\n (   ͡° ͜ʖ ͡° )  ͡° ͜ʖ ͡° )\n  (   ͡° ͜ʖ ͡° )  ͜ʖ ͡° )\n   (   ͡° ͜ʖ ͡° )  ͡° )\n    (   ͡° ͜ʖ ͡° )° )\n     (   ͡° ͜ʖ ͡° )\n    ( (   ͡° ͜ʖ ͡° )\n   (   (   ͡° ͜ʖ ͡° )\n  (   ͡° (   ͡° ͜ʖ ͡° )\n (   ͡° ͜ʖ (   ͡° ͜ʖ ͡° )\n(   ͡° ͜ʖ ͡° (   ͡° ͜ʖ ͡° )\n(   ͡° ͜ʖ ͡° )(   ͡° ͜ʖ ͡° )\n(   ͡° ͜ʖ ͡° ) (   ͡° ͜ʖ ͡° )\n(   ͡° ͜ʖ ͡° )(   ͡° ͜ʖ ͡° )\n (   ͡° ͜ʖ ͡° )  ͡° ͜ʖ ͡° )\n  (   ͡° ͜ʖ ͡° )  ͜ʖ ͡° )\n   (   ͡° ͜ʖ ͡° )  ͡° )\n    (   ͡° ͜ʖ ͡° )° )\n     (   ͡° ͜ʖ ͡° ))\n     (   ͡° ͜ʖ ͡° )\n    ( (   ͡° ͜ʖ ͡° )\n   (   (   ͡° ͜ʖ ͡° )\n  (   ͡° (   ͡° ͜ʖ ͡° )\n (   ͡° ͜ʖ (   ͡° ͜ʖ ͡° )\n(   ͡° ͜ʖ ͡° (   ͡° ͜ʖ ͡° )\n(   ͡° ͜ʖ ͡° )(   ͡° ͜ʖ ͡° )\n(   ͡° ͜ʖ ͡° ) (   ͡° ͜ʖ ͡° )\n(   ͡° ͜ʖ ͡° )(   ͡° ͜ʖ ͡° )\n (   ͡° ͜ʖ ͡° )  ͡° ͜ʖ ͡° )\n  (   ͡° ͜ʖ ͡° )  ͜ʖ ͡° )\n   (   ͡° ͜ʖ ͡° )  ͡° )\n    (   ͡° ͜ʖ ͡° )° )\n     (   ͡° ͜ʖ ͡° )";
        }
        else if (str.equals("!chase"))
        {
          localObject = "☁☀    ☁         ☁  ☁\n       ☁                🚁   ☁\n\n_🌵_🌻________🌵_____\n                 /  |  \\\n         🌴 /🚔    \\ 🌴 \n             /      |      \\\n     🌴 /        🚔    \\ 🌴\n         /          |    🚔 \\\n⛽  /  🚔             🚔 \\\n🌴/            🚔            \\ 🌴\n   /                                \\\n /                  |        🚘    \\";
        }
        else if (str.equals("!spooki"))
        {
          localObject = "┈┊┈┊┈┊┈╱▔▔╲╭╮\n┊┈┊┈┊┈╱▂▂╱▔╰╯\n┈┊┈┊┈╱▔▔▔╲\n┊┈┊┈╭▏▊▕▊▕╮\n┈┊┈┊╰▏╭━╮▕╯\n┊┈┊┈┊╲╰━╯╱\n╱▔▔▔╲╱▔▔▔╲╱▔▔▔╲\n╲╱▔╲▂╲▔▔▔╱▂╱▔╲╱\n┈┊┈┊┈╱▔▔▔╲\n┊┈┊┈┊╲▔▔▔╱\n┈┊┈┊┈╱▔▔▔╲\n┊┈┊┈┊╲▔▔▔╱\n┈┊┈┊┈╱▔▔▔╲\n┊┈┊┈┊╲▔▔▔╱\n┈┊┈┊┈╱▔▔▔╲\n┊┈┊┈┊╲▔▔▔╱";
        }
		else if (str.equals("!loading"))
        {
          localObject = "Loading…\n█▒▒▒▒▒▒▒▒▒\n10%\n███▒▒▒▒▒▒▒\n30%\n█████▒▒▒▒▒\n50%\n███████▒▒▒\n99%\n██████████";
        }
        else if (str.equals("!chess"))
        {
          localObject = "♜♞♝♚♛♝♞♜\n♟♟♟♟♟♟♟♟\n▓░▓░▓░▓░▓░▓░\n░▓░▓░▓░▓░▓░▓\n▓░▓░▓░▓░▓░▓░\n░▓░▓░▓░▓░▓░▓\n♙♙♙♙♙♙♙♙\n♖♘♗♔♕♗♘♖";
        }
        else if (str.equals("!coffee"))
        {
          localObject = ". .((\n. . .)\n. ( (\n████╗\n████║\n████╝";
        }
        else if (str.equals("!iphone"))
        {
          localObject = "̧̰̞̦̩̭̮̼̜̪̱̗̗̋̑̊̽̐̋̑̊̽▓̧̰̞̦̩̭̮̼̜̪̱̗̗̋̑̊̽̐̋̑̊̽▓̧̰̞̦̩̭̮̼̜̪̱̗̗̋̑̊̽̐̋̑▓̧̰̞̦̩̭̮̼̜̪̱̗̗̋̑̊̽̐̋̑̊▓̧̰̞̦̩��̮̼̜̪̱̗̗̋̑̊̽̐̋̑̊̽▓̧̰̞̦̩̭̮̼̜̪̱̗̗̋̑̊̽̐̋̑▓̧̰̞̦̩̭̮̼̜̪̱̗̗̋̑̊̽̐̋̑̊̽▓̧̰̞̦̩̭̮̼̜̪̱̗̗̋̑̊̽̐̋̑̊̽▓̧̰̞̦̩̭̮̼̜̪̱̗̗̋̑̊̽̐̋̑̊̽▓̧̰̞̦̩̭̮̼̜̪̱̗̗̋̑̊̽̐̋̑▓̧̰̞̦̩̭̮̼̜̪̱̗̗̋̑̊̽̐̋̑̊▓̧̰̞̦̩̭̮̼̜̪̱̗̗̋̑̊̽̐̋̑̊̽▓̧̰̞̦̩̭̮̼̜̪̱̗̗̋̑̊̽̐̋̑▓̧̧̰̞̦̩̭̮̼̜̪̱̗̗̰̞̦̩̭̮̼̜̪̱̗̗̋̑̊̽̐̋̑̊̽̋̑̊̽̐̋̑̊̽▓̧̰̞̦̩̭̮̼̜̪̱̗̗̋̑̊̽̐̋̑̊̽▓̧̰̞̦̩̭̮̼̜̪̱̗̗̋̑̊̽̐̋̑▓̧̰̞̦̩̭̮̼̜̪̱̗̗̋̑̊̽̐̋̑̊▓̧̰̞̦̩̭̮̼̜̪̱̗̗̋̑̊̽̐̋̑̊̽▓̧̰̞̦̩̭̮̼̜̪̱̗̗̋̑̊̽̐̋̑▓̧̰̞̦̩̭̮̼̜̪̱̗̗̋̑̊̽̐̋̑̊̽▓̧̰̞̦̩̭̮̼̜̪̱̗̗̋̑̊̽̐̋̑̊̽▓̧̰̞̦̩̭̮̼̜̪̱̗̗̋̑̊̽̐̋̑▓̧̰̞̦̩̭̮̼̜̪̱̗̗̋̑̊̽̐̋̑̊▓̧̰̞̦̩̭̮̼̜̪̱̗̗̋̑̊̽̐̋̑̊̽▓̧̰̞̦̩̭̮̼̜̪̱̗̗̋̑̊̽̐̋̑▓̧̰̞̦̩̭̮̼̜̪̱̗̗̋̑̊̽̐̋̑̊̽▓̧̰̞̦̩̭̮̼̜̪̱̗̗̋̑̊̽̐̋̑̊̽▓̧̰̞̦̩̭̮̼̜̪̱̗̗̋̑̊̽̐̋̑̊̽▓̧̰̞̦̩̭̮̼̜̪̱̗̗̋̑̊̽̐̋̑▓̧̰̞̦̩̭̮̼̜̪̱̗̗̋̑̊̽̐̋̑̊▓̧̰̞̦̩̭̮̼̜̪̱̗̗̋̑̊̽̐̋̑̊̽▓̧̰̞̦̩̭̮̼̜̪̱̗̗̋̑̊̽̐̋̑▓̧̰̞̦̩̭̮̼̜̪̱̗̗̋̑̊̽̐̋̑̊̽▓̧̰̞̦̩̭̮̼̜̪̱̗̗̋̑̊̽̐̋̑̊̽▓̧̰̞̦̩̭̮̼̜̪̱̗̗̋̑̊̽̐̋̑̊̽▓̧̰̞̦̩̭̮̼̜̪̱̗̗̋̑̊̽̐̋̑▓̧̰̞̦̩̭̮̼̜̪̱̗̗̋̑̊̽̐̋̑̊▓̧̰̞̦̩̭̮̼̜̪̱̗̗̋̑̊̽̐̋̑̊̽▓̧̰̞̦̩̭̮̼̜̪̱̗̗̋̑̊̽̐̋̑▓̧̧̰̞̦̩̭̮̼̜̪̱̗̗̰̞̦̩̭̮̼̜̪̱̗̗̋̑̊̽̐̋̑̊̽̋̑̊̽̐̋̑̊̽▓̧̰̞̦̩̭̮̼̜̪̱̗̗̋̑̊̽̐̋̑̊̽▓̧̰̞̦̩̭̮̼̜̪̱̗̗̋̑̊̽̐̋̑▓̧̰̞̦̩̭̮̼̜̪̱̗̗̋̑̊̽̐̋̑̊▓̧̰̞̦̩̭̮̼̜̪̱̗̗̋̑̊̽̐̋̑̊̽";
        }
        else if (str.equals("!smile"))
        {
          localObject = "╔╦╦╦╦╦╦╦╦╦╦╦╦╗\n╠╬╬╬╬╬╬╬╬╬╬╬╬╣\n╠╬╬╬╬╬╬╬╬╬╬╬╬╣\n╠╬╬█╬╬╬╬╬╬█╬╬╣\n╠╬╬╬╬╬╬╬╬╬╬╬╬╣\n╠╬╬╬╬╬╬╬╬╬╬╬╬╣\n╠╬█╬╬╬╬╬╬╬╬█╬╣\n╠╬██████████╬╣\n╠╬╬╬╬╬╬╬╬╬╬╬╬╣\n╚╩╩╩╩╩╩╩╩╩╩╩╩╝";
        }
        else if (str.equals("!sad"))
        {
          localObject = "╔╦╦╦╦╦╦╦╦╦╦╦╦╗\n╠╬╬╬╬╬╬╬╬╬╬╬╬╣\n╠╬╬╬╬╬╬╬╬╬╬╬╬╣\n╠╬╬█╬╬╬╬╬╬█╬╬╣\n╠╬╬╬╬╬╬╬╬╬╬╬╬╣\n╠╬╬╬╬╬╬╬╬╬╬╬╬╣\n╠╬╬╬╬╬╬╬╬╬╬╬╬╣\n╠╬██████████╬╣\n╠╬█╬╬╬╬╬╬╬╬█╬╣\n╚╩╩╩╩╩╩╩╩╩╩╩╩╝";
        }
        else if (str.equals("!peace"))
        {
          localObject = "☆┌─┐   ─┐☆\n　│▒│ /▒/\n　│▒│/▒/\n　│▒ /▒/─┬─┐◯\n　│▒│▒|▒│▒│\n┌┴─┴─┐-┘─┘\n│▒┌──┘▒▒▒│◯\n└┐▒▒▒▒▒▒┌┘\n◯└┐▒▒▒▒┌";
        }
        else if (str.equals("!fuckup"))
        {
          localObject = " ....................../´¯/) \n....................,/¯../ \n.................../..../ \n............./´¯/'...'/´¯¯`·¸ \n........../'/.../..../......./¯\\ \n........('(...´...´.... ¯~/'...') \n.........\\.................'...../ \n..........''...\\.......... _.·´ \n............\\..............( \n..............\\.............\\... ";
        }
        else if (str.equals("!fab"))
        {
          localObject = "⊂_ヽ\n　 ＼＼ ＿\n　　 ＼(　•_•) F\n　　　 <　⌒ヽ A\n　　　/ 　 へ＼ B\n　　 /　　/　＼＼ U\n　　 ﾚ　ノ　　 ヽ_つ L\n　　/　/                   O\n　 /　/|                   U\n　(　(ヽ               S\n　|　|、＼\n　| 丿 ＼ ⌒)\n　| |　　) /\n`ノ )　   Lﾉ\n(_／";
        }
        else if (str.equals("!lurk"))
        {
          localObject = "┳┻|\n┻┳I\n┳┻|∧_ ∧\n┻┳| ಠ_ಠ )\n┳┻|⊂ﾉ\n┻┳|Ｊ\nAm I alone here?\n\n┳┻|\n┻┳I\n┳┻|_ ∧\n┻┳| _ಠ )\n┳┻|⊂ﾉ\n┻┳|Ｊ\nIt seems so...\n\n┳┻|\n┻┳I\n┳┻|\n┻┳| \n┳┻|\n┻┳|\nI'm gonna lurk until something happens";
        }
/*END Art Commands*/
/*Word Commands*/
        else if (str.equals("!commands4"))
		{
          localObject = "All commands,\nDevs & info: !Commands\nFunctions: !Commands2\nArt: !Commands3\nWords: !Commands4\nCustom Commands: !Commands5\nHELP: !HELP\n\nWord Commands:\n!Please\n!Sorry\n!Cute\n!OMG\n!WOW\n!WTF\n!LOL\n!Hi\n!FAIL\n!Nice\n!STFU\n!FuckYou";
        }
        else if (str.equals("!please"))
        {
          localObject = "╔═╦╗╔═╦══╦═╦═╗\n║╬║║║╦╣╔╗║═╣╦╝\n║╔╣╚╣╩╣╠╣╠═║╩╗\n╚╝╚═╩═╩╝╚╩═╩═╝";
        }
        else if (str.equals("!sorry"))
        {
          localObject = "╔═╗\n║═╬═╦╦╦╦╦╦╗\n╠═║╬║╔╣╔╣║║\n╚═╩═╩╝╚╝╠╗║\n────────╚═╝";
        }
        else if (str.equals("!cute"))
        {
          localObject = "╔═╦╦╦══╦═╗\n║╔╣║╠╗╔╣╦╝\n║╚╣║║║║║╩╗\n╚═╩═╝╚╝╚═╝";
        }
        else if (str.equals("!omg"))
        {
          localObject = "╔═╦══╦═╗\n║╬║║║║╬║\n╚═╩╩╩╬╗║\n─────╚═╝";
        }
        else if (str.equals("!wow"))
        {
          localObject = "╔╦╦╦═╦╦╦╗\n║║║║╬║║║║\n╚══╩═╩══╝";
        }
        else if (str.equals("!wtf"))
        {
          localObject = "───╔╗╔═╗\n╔╦╦╣╚╣═╣\n║║║║╔╣╔╝\n╚══╩═╩╝";
        }
        else if (str.equals("!lol"))
        {
          localObject = "┈▁┈┈┈┈▁▁▁┈┈▁\n╱╱▏┈┈╱╱╱╱▏╱╱▏\n▇╱▏┈┈▇▇▇╱▏▇╱▏\n▇╱▏▁┈▇╱▇╱▏▇╱▏▁\n▇╱╱╱▏▇╱▇╱▏▇╱╱╱▏\n▇▇▇╱┈▇▇▇╱┈▇▇▇╱";
        }
        else if (str.equals("!hi"))
        {
          localObject = "▒█░▒█ ▀█▀\n▒█▀▀█ ▒█░\n▒█░▒█ ▄█▄";
        }
        else if (str.equals("!fail"))
        {
          localObject = "▄▄▄▄▄▄▄▄▄▄▄▄\n██▌▄▌▄▐▐▌███\n██▌▄▌▄▐▐▌▀██\n▀▀▀▀▀▀▀▀▀▀▀▀";
        }
        else if (str.equals("!nice"))
        {
          localObject = "███╗   ██╗ \n████╗  ██║ \n██╔██╗ ██║ \n██║╚██╗██║ \n██║ ╚████║ \n╚═╝  ╚═══╝ \n           \n██╗        \n██║        \n██║        \n██║        \n██║        \n╚═╝        \n           \n ██████╗   \n██╔════╝   \n██║        \n██║        \n╚██████╗   \n ╚═════╝   \n           \n███████╗   \n██╔════╝   \n█████╗     \n██╔══╝     \n███████╗   \n╚══════╝";
        }
        else if (str.equals("!stfu"))
        {
          localObject = "██████████\n██████████\n███\n██████████\n██████████\n                    ███\n██████████\n██████████\n\n██████████\n██████████\n       ████\n       ████\n       ████\n       ████\n       ████\n       ████\n\n██████████\n██████████\n████\n█████████\n█████████\n████\n████\n████\n\n████     ████\n████     ████\n████     ████\n████     ████\n████     ████\n████     ████\n██████████\n██████████";
        }
        else if (str.equals("!fuckyou"))
        {
          localObject = "██████████\n██████████\n████\n█████████\n█████████\n████\n████\n████\n\n████     ████\n████     ████\n████     ████\n████     ████\n████     ████\n████     ████\n██████████\n██████████\n\n██████████\n██████████\n████     \n████     \n████     \n████     \n██████████\n██████████\n\n████    ████\n████   ████\n████  ████\n████ ████\n████████\n████  ████\n████    ████\n████      ████\n████       ████\n\n\n\n\n████      ████\n████      ████\n████      ████\n████      ████\n  █████████\n        ████\n        ████\n        ████\n        ████\n        ████\n\n██████████\n██████████\n████     ████\n████     ████\n████     ████\n████     ████\n██████████\n██████████\n\n████     ████\n████     ████\n████     ████\n████     ████\n████     ████\n████     ████\n██████████\n██████████";
        }
/*END Word Commands*/
/*Custom Commands*/
        else if (str.equals("!commands5"))
		{
          localObject = "All commands,\nDevs & info: !Commands\nFunctions: !Commands2\nArt: !Commands3\nWords: !Commands4\nCustom Commands: !Commands5\nHELP: !HELP\n\nCustom Commands:\n!CustomCom";
        }
        else if (str.equals("!customcom"))
        {
          localObject = "Custom Commands:\n\n!a \"text..\" (Ascii)\n!b \"text..\" (Blue letters)\n!c \"text..\" (Circled letters)\n!d \"text..\" (Reversed letters)";
        }
        else if (str.equals("!test17"))
        {
          localObject = "Backup Command";
        }
        else if (str.equals("!test18"))
        {
          localObject = "Backup Command";
        }
        else if (str.equals("!test19"))
        {
          localObject = "Backup Command";
        }
        else if (str.equals("!test20"))
        {
          localObject = "Backup Command";
        }
        else if (str.equals("!test21"))
        {
          localObject = "Backup Command";
        }
        else if (str.equals("!test22"))
        {
          localObject = "Backup Command";
        }
        else if (str.equals("!test23"))
        {
          localObject = "Backup Command";
        }
        else if (str.equals("!test24"))
        {
          localObject = "Backup Command";
        }
        else if (str.equals("!test25"))
        {
          localObject = "Backup Command";
        }
        else if (str.equals("!test26"))
        {
          localObject = "Backup Command";
        }
        else if (str.equals("!test27"))
        {
          localObject = "Backup Command";
        }
        else if (str.equals("!test28"))
        {
          localObject = "Backup Command";
        }
        else if (str.equals("!test29"))
        {
          localObject = "Backup Command";
        }
        else if (str.equals("!test30"))
        {
          localObject = "Backup Command";
        }
        else if (str.equals("!test31"))
        {
          localObject = "Backup Command";
        }
        else if (str.equals("!test32"))
        {
          localObject = "Backup Command";
        }
        else if (str.equals("!test33"))
        {
          localObject = "Backup Command";
        }
        else if (str.equals("!test34"))
        {
          localObject = "Backup Command";
        }
        else if (str.equals("!test35"))
        {
          localObject = "Backup Command";
        }
        else if (str.equals("!test36"))
        {
          localObject = "Backup Command";
        }
        else if (str.equals("!test37"))
        {
          localObject = "Backup Command";
        }
        else if (str.equals("!test38"))
        {
          localObject = "Backup Command";
        }
        else if (str.equals("!test39"))
        {
          localObject = "Backup Command";
        }
        else if (str.equals("!test40"))
        {
          localObject = "Backup Command";
        }
/*END Custom Commands*/
        else if ((str.toLowerCase().startsWith("!a ")) && (str.length() >= 2))
        {
          localObject = str.substring(3).toLowerCase().replace("a", "▒▒▒▒▒▒▒▒▒\n▒▒▒▒█▒▒▒▒\n▒▒▒█▒█▒▒▒\n▒▒█▒▒▒█▒▒\n▒███████▒\n▒█▒▒▒▒▒█▒\n").replace("b", "▒▒▒▒▒▒▒▒▒\n▒██████▒▒\n▒█▒▒▒▒▒█▒\n▒██████▒▒\n▒█▒▒▒▒▒█▒\n▒██████▒▒\n").replace("c", "▒▒▒▒▒▒▒▒▒\n▒███████▒\n▒█▒▒▒▒▒▒▒\n▒█▒▒▒▒▒▒▒\n▒█▒▒▒▒▒▒▒\n▒███████▒\n").replace("d", "▒▒▒▒▒▒▒▒▒\n▒██████▒▒\n▒█▒▒▒▒▒█▒\n▒█▒▒▒▒▒█▒\n▒█▒▒▒▒▒█▒\n▒██████▒▒\n").replace("e", "▒▒▒▒▒▒▒▒▒\n▒███████▒\n▒█▒▒▒▒▒▒▒\n▒██████▒▒\n▒█▒▒▒▒▒▒▒\n▒███████▒\n").replace("f", "▒▒▒▒▒▒▒▒▒\n▒███████▒\n▒█▒▒▒▒▒▒▒\n▒██████▒▒\n▒█▒▒▒▒▒▒▒\n▒█▒▒▒▒▒▒▒\n").replace("g", "▒▒▒▒▒▒▒▒▒\n▒███████▒\n▒█▒▒▒▒▒▒▒\n▒█▒▒▒▒██▒\n▒█▒▒▒▒▒█▒\n▒███████▒\n").replace("h", "▒▒▒▒▒▒▒▒▒\n▒█▒▒▒▒▒█▒\n▒█▒▒▒▒▒█▒\n▒███████▒\n▒█▒▒▒▒▒█▒\n▒█▒▒▒▒▒█▒\n").replace("i", "▒▒▒▒▒▒▒▒▒\n▒███████▒\n▒▒▒▒█▒▒▒▒\n▒▒▒▒█▒▒▒▒\n▒▒▒▒█▒▒▒▒\n▒███████▒\n").replace("j", "▒▒▒▒▒▒▒▒▒\n▒▒▒▒▒▒▒█▒\n▒▒▒▒▒▒▒█▒\n▒▒▒▒▒▒▒█▒\n▒█▒▒▒▒▒█▒\n▒███████▒\n").replace("k", "▒▒▒▒▒▒▒▒▒\n▒█▒▒▒▒▒█▒\n▒█▒▒▒▒█▒▒\n▒█████▒▒▒\n▒█▒▒▒▒█▒▒\n▒█▒▒▒▒▒█▒\n").replace("l", "▒▒▒▒▒▒▒▒▒\n▒█▒▒▒▒▒▒▒\n▒█▒▒▒▒▒▒▒\n▒█▒▒▒▒▒▒▒\n▒█▒▒▒▒▒▒▒\n▒███████▒\n").replace("m", "▒▒▒▒▒▒▒▒▒\n▒█▒▒▒▒▒█▒\n▒██▒▒▒██▒\n▒█▒█▒█▒█▒\n▒█▒▒█▒▒█▒\n▒█▒▒▒▒▒█▒\n").replace("n", "▒▒▒▒▒▒▒▒▒\n▒██▒▒▒▒█▒\n▒█▒█▒▒▒█▒\n▒█▒▒█▒▒█▒\n▒█▒▒▒█▒█▒\n▒█▒▒▒▒██▒\n").replace("o", "▒▒▒▒▒▒▒▒▒\n▒███████▒\n▒█▒▒▒▒▒█▒\n▒█▒▒▒▒▒█▒\n▒█▒▒▒▒▒█▒\n▒███████▒\n").replace("p", "▒▒▒▒▒▒▒▒▒\n▒██████▒▒\n▒█▒▒▒▒▒█▒\n▒██████▒▒\n▒█▒▒▒▒▒▒▒\n▒█▒▒▒▒▒▒▒\n").replace("q", "▒▒▒▒▒▒▒▒▒\n▒███████▒\n▒█▒▒▒▒▒█▒\n▒█▒▒▒█▒█▒\n▒█▒▒▒▒██▒\n▒████████\n").replace("r", "▒▒▒▒▒▒▒▒▒\n▒██████▒▒\n▒█▒▒▒▒▒█▒\n▒██████▒▒\n▒█▒▒▒▒▒█▒\n▒█▒▒▒▒▒█▒\n").replace("s", "▒▒▒▒▒▒▒▒▒\n▒███████▒\n▒█▒▒▒▒▒▒▒\n▒███████▒\n▒▒▒▒▒▒▒█▒\n▒███████▒\n").replace("t", "▒▒▒▒▒▒▒▒▒\n▒███████▒\n▒▒▒▒█▒▒▒▒\n▒▒▒▒█▒▒▒▒\n▒▒▒▒█▒▒▒▒\n▒▒▒▒█▒▒▒▒\n").replace("u", "▒▒▒▒▒▒▒▒▒\n▒█▒▒▒▒▒█▒\n▒█▒▒▒▒▒█▒\n▒█▒▒▒▒▒█▒\n▒█▒▒▒▒▒█▒\n▒███████▒\n").replace("v", "▒▒▒▒▒▒▒▒▒\n▒█▒▒▒▒▒█▒\n▒█▒▒▒▒▒█▒\n▒▒█▒▒▒█▒▒\n▒▒▒█▒█▒▒▒\n▒▒▒▒█▒▒▒▒\n").replace("w", "▒▒▒▒▒▒▒▒▒\n▒█▒▒▒▒▒█▒\n▒█▒▒█▒▒█▒\n▒█▒█▒█▒█▒\n▒██▒▒▒██▒\n▒█▒▒▒▒▒█▒\n").replace("x", "▒▒▒▒▒▒▒▒▒\n▒█▒▒▒▒▒█▒\n▒▒█▒▒▒█▒▒\n▒▒▒███▒▒▒\n▒▒█▒▒▒█▒▒\n▒█▒▒▒▒▒█▒\n").replace("y", "▒▒▒▒▒▒▒▒▒\n▒█▒▒▒▒▒█▒\n▒▒█▒▒▒█▒▒\n▒▒▒█▒█▒▒▒\n▒▒▒▒█▒▒▒▒\n▒▒▒▒█▒▒▒▒\n").replace("z", "▒▒▒▒▒▒▒▒▒\n▒███████▒\n▒▒▒▒▒▒█▒▒\n▒▒▒███▒▒▒\n▒▒█▒▒▒▒▒▒\n▒███████▒\n").replace(" ", "\n").replace("0", "▒▒▒▒▒▒▒▒▒\n▒███████▒\n▒█▒▒▒█▒█▒\n▒█▒▒█▒▒█▒\n▒█▒█▒▒▒█▒\n▒███████▒\n").replace("1", "▒▒▒▒▒▒▒▒▒\n▒▒▒▒█▒▒▒▒\n▒▒▒██▒▒▒▒\n▒▒▒▒█▒▒▒▒\n▒▒▒▒█▒▒▒▒\n▒███████▒\n").replace("2", "▒▒▒▒▒▒▒▒▒\n▒███████▒\n▒▒▒▒▒▒▒█▒\n▒███████▒\n▒█▒▒▒▒▒▒▒\n▒███████▒\n").replace("3", "▒▒▒▒▒▒▒▒▒\n▒███████▒\n▒▒▒▒▒▒▒█▒\n▒███████▒\n▒▒▒▒▒▒▒█▒\n▒███████▒\n").replace("4", "▒▒▒▒▒▒▒▒▒\n▒█▒▒▒▒▒█▒\n▒█▒▒▒▒▒█▒\n▒███████▒\n▒▒▒▒▒▒▒█▒\n▒▒▒▒▒▒▒█▒\n").replace("5", "▒▒▒▒▒▒▒▒▒\n▒███████▒\n▒█▒▒▒▒▒▒▒\n▒██████▒▒\n▒▒▒▒▒▒▒█▒\n▒██████▒▒\n").replace("6", "▒▒▒▒▒▒▒▒▒\n▒███████▒\n▒█▒▒▒▒▒▒▒\n▒███████▒\n▒█▒▒▒▒▒█▒\n▒███████▒\n").replace("7", "▒▒▒▒▒▒▒▒▒\n▒███████▒\n▒▒▒▒▒▒▒█▒\n▒▒▒▒▒▒▒█▒\n▒▒▒▒▒▒▒█▒\n▒▒▒▒▒▒▒█▒\n").replace("8", "▒▒▒▒▒▒▒▒▒\n▒███████▒\n▒█▒▒▒▒▒█▒\n▒███████▒\n▒█▒▒▒▒▒█▒\n▒███████▒\n").replace("9", "▒▒▒▒▒▒▒▒▒\n▒███████▒\n▒█▒▒▒▒▒█▒\n▒███████▒\n▒▒▒▒▒▒▒█▒\n▒███████▒\n").replace("?", "▒▒▒▒▒▒▒▒▒\n▒▒█████▒▒\n▒█▒▒▒▒▒█▒\n▒▒▒▒▒▒█▒▒\n▒▒▒▒█▒▒▒▒\n▒▒▒▒▒▒▒▒▒\n▒▒▒▒█▒▒▒▒\n").replace("#", "▒▒▒▒▒▒▒▒▒\n▒▒█▒▒▒█▒▒\n▒███████▒\n▒▒█▒▒▒█▒▒\n▒███████▒\n▒▒█▒▒▒█▒▒\n");
        }
        else if ((str.toLowerCase().startsWith("!b ")) && (str.length() >= 4))
        {
          localObject = str.substring(3).toLowerCase().replace("a", "‌🇦").replace("b", "‌🇧").replace("c", "‌🇨").replace("d", "‌🇩").replace("e", "‌🇪").replace("f", "‌🇫").replace("g", "‌🇬").replace("h", "‌🇭").replace("i", "‌🇮").replace("j", "‌🇯").replace("k", "‌🇰").replace("l", "‌🇱").replace("m", "‌🇲").replace("n", "‌🇳").replace("o", "‌🇴").replace("p", "‌🇵").replace("q", "‌🇶").replace("r", "‌🇷").replace("s", "‌🇸").replace("t", "‌🇹").replace("u", "‌🇺").replace("v", "‌🇻").replace("w", "‌🇼").replace("x", "‌🇽").replace("y", "‌🇾").replace("z", "‌🇿").replace("?", "‌?❔").replace("!", "‌?❕");
        }
        else if ((str.toLowerCase().startsWith("!c ")) && (str.length() >= 2))
        {
          localObject = str.substring(3).toLowerCase().replace("a", "ⓐ").replace("b", "ⓑ").replace("c", "ⓒ").replace("d", "ⓓ").replace("e", "ⓔ").replace("f", "ⓕ").replace("g", "ⓖ").replace("h", "ⓗ").replace("i", "ⓘ").replace("j", "ⓙ").replace("k", "ⓚ").replace("l", "ⓛ").replace("m", "ⓜ").replace("n", "ⓝ").replace("o", "ⓞ").replace("p", "ⓟ").replace("q", "ⓠ").replace("r", "ⓡ").replace("s", "ⓢ").replace("t", "ⓣ").replace("u", "ⓤ").replace("v", "ⓥ").replace("w", "ⓦ").replace("x", "ⓧ").replace("y", "ⓨ").replace("z", "ⓩ").replace("0", "➓").replace("1", "➊").replace("2", "➋").replace("3", "➌").replace("4", "➍").replace("5", "➎").replace("6", "➏").replace("7", "u2790").replace("8", "u2791").replace("9", "u2792");
        }
        else
        {
          localObject = str;
          if (str.toLowerCase().startsWith("!d "))
          {
            localObject = str;
            if (str.length() >= 4) {
              localObject = str.substring(3).toLowerCase().replace("a", "ɐ").replace("b", "q").replace("c", "ɔ").replace("d", "p").replace("e", "ǝ").replace("f", "ɟ").replace("g", "ƃ").replace("h", "ɥ").replace("i", "ı").replace("j", "ɾ").replace("k", "ʞ").replace("l", "l").replace("m", "ɯ").replace("n", "u").replace("o", "o").replace("p", "d").replace("q", "b").replace("r", "ɹ").replace("s", "s").replace("t", "ʇ").replace("u", "n").replace("v", "ʌ").replace("w", "ʍ").replace("x", "x").replace("y", "ʎ").replace("z", "z").replace("?", "¿").replace("!", "¡");
            }
          }
        }
      }
    }
    for (;;)
    {
      return (String)localObject;
      localObject = (k)kik.a.b.a.f.a(this, 4);
      if (localObject != null)
      {
        localObject = ((k)localObject).a();
      }
      else
      {
        localObject = (j)kik.a.b.a.f.a(this, 7);
        if (localObject != null) {
          localObject = ((j)localObject).a();
        } else {
          localObject = null;
        }
      }
    }
  }
  
  final void a(int paramInt)
  {
    if (paramInt == -100) {
      this.d = paramInt;
    }
    for (;;)
    {
      return;
      if (paramInt > this.d) {
        this.d = paramInt;
      }
    }
  }
  
  public final void a(long paramLong)
  {
    this.m = paramLong;
  }
  
  public final void a(kik.a.b.a.f paramf)
  {
    this.i.add(paramf);
  }
  
  public final void a(boolean paramBoolean)
  {
    this.g = paramBoolean;
  }
  
  public final void a(byte[] paramArrayOfByte)
  {
    this.l = paramArrayOfByte;
  }
  
  public final String b()
  {
    return this.f;
  }
  
  public final void b(boolean paramBoolean)
  {
    this.k = paramBoolean;
  }
  
  public final int c()
  {
    return this.d;
  }
  
  public final boolean d()
  {
    return this.c;
  }
  
  public final long e()
  {
    return this.j;
  }
  
  public final int f()
  {
    return this.e;
  }
  
  public final void g()
  {
    this.e += 1;
  }
  
  public final String h()
  {
    return this.b;
  }
  
  public final String i()
  {
    return this.a;
  }
  
  public final boolean j()
  {
    return this.g;
  }
  
  public final boolean k()
  {
    return this.k;
  }
  
  public final Vector l()
  {
    return this.i;
  }
  
  public final boolean m()
  {
    return this.h;
  }
  
  public final void n()
  {
    this.h = true;
  }
  
  public final byte[] o()
  {
    return this.l;
  }
  
  public final long p()
  {
    return this.m;
  }
  
  public final String toString()
  {
    return "message: " + a();
  }
}


/* Location:              C:\Users\EX\Desktop\PROJECTS\SYSCUS\Coding\APKs\APK Mod Kit\Projects\SYSCUS\Workspace 1\classes-dex2jar.src\kik\a\b\o\o.class
 * Java compiler version: 6 (50.0)
 * JD-Core Version:       NONE
 */
